In [1]:
import pandas as pd

In [2]:
# Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.
df = pd.DataFrame({"key" :[4, 8, 15, 16, 23,  42]})
print(df)
df

   key
0    4
1    8
2   15
3   16
4   23
5   42

   key
0    4
1    8
2   15
3   16
4   23
5   42

In [3]:
#Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the
#variable print it.

my_list = [1,2,3,4,5,6,7,8,9,10]
df1 = pd.Series(my_list)
print(df1)

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64

In [4]:
my_table = pd.DataFrame({"Name":["Alice","Bob","Claire"],
                         "Age" :[25,30,27],
                         "Gender":["Female","Male","Female"]})

In [5]:
my_table

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

In [6]:
print(my_table)

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

4) DataFrame is a 2-dimensional labeled data structure with columns of potentially different types.

a Pandas Series is a 1D array of data, but a single-column DataFrame is a 2D table with one column.

In [7]:
my_list = [1,2,3,4,5,6,7,8,9,10]
df1 = pd.Series(my_list)
print(df1)

my_table = pd.DataFrame({"Name":["Alice","Bob","Claire"],
                         "Age" :[25,30,27],
                         "Gender":["Female","Male","Female"]})
print(my_table)

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64
     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

In [8]:
data = {'Name': ['John', 'Emily', 'Ryan'],
        'Age': [25, 30, 35],
        'City': ['New York', 'London', 'Paris']}
df = pd.DataFrame(data)

In [9]:
df.head()

    Name  Age      City
0   John   25  New York
1  Emily   30    London
2   Ryan   35     Paris

In [10]:
df.describe()

        Age
count   3.0
mean   30.0
std     5.0
min    25.0
25%    27.5
50%    30.0
75%    32.5
max    35.0

In [11]:
df_sorted = df.sort_values('Age')  
print(df_sorted)

    Name  Age      City
0   John   25  New York
1  Emily   30    London
2   Ryan   35     Paris

6)

In pandas, Series and DataFrame are mutable in nature, while Panel is not mutable. This means that Series and DataFrame objects can be modified, updated, or have values changed after their creation. On the other hand, Panel objects, which are three-dimensional data structures, do not support direct modification of their contents.

In [12]:
name_series = pd.Series(['John', 'Emily', 'Ryan'])
age_series = pd.Series([25, 30, 35])
city_series = pd.Series(['New York', 'London', 'Paris'])

df2 = pd.DataFrame({"name" : name_series,
                   "age" : age_series,
                    "city" : city_series
                   })

In [13]:
df2

    name  age      city
0   John   25  New York
1  Emily   30    London
2   Ryan   35     Paris